#+property: header-args:R :session *bioR* :results output :exports both

  #+begin_src R :tangle R-intro/code/0403.R
  #+end_src

* 1. R の起動と終了

  システムによって異なりますが、通常はコマンドラインで R と入力するか、
  R のアイコンをダブルクリックして起動します。R を終了させるときは、

  #+begin_src R 

   q()

  #+end_src


  と入力します。

* 2. 簡単な変数への代入

  変数とは様々な値を格納する箱のような概念です。例えば今 x という変数を考え、そこ
  に 123 を代入したければ、

  #+begin_src R :session t :results output :exports both

   (x <- 123)

  #+end_src

  #+RESULTS:
  : [1] 123

  とします。その後に x と打ち込むと、下記のように x の値が表示されます。

  実は R は単一の数値だけでなく、複数の数値をベクトルとして扱うことが
  得意です。例えばベクトル(1, 3, 5)を変数 y に代入したければ、c とい
  う記号を先頭に付けて、

  #+begin_src R :session t :results output :exports both

(y <- c(1, 3, 5))

  #+end_src

  #+RESULTS:
  : [1] 1 3 5

  とします。

  2 から 5 までの整数を 含むベクトルを作成するには、

  #+begin_src R :session t :results output :exports both

(y <- c(2,3,4,5))

(y<-2:5) # 簡略化

  #+end_src

  #+RESULTS:
  : [1] 2 3 4 5
  : [1] 2 3 4 5


**  課題 2-1:
   
    変数 z にベクトル(10, 11, 12)を代入し、またそれを表示してみましょう。

    #+begin_src R :tangle R-intro/code/0403.R

(z <- c(10, 11, 12))

   #+end_src

   #+RESULTS:
   
 1 単一の数値(スカラー)は実は一次元ベクトルとみなされると考えればよい。
 
#+begin_src R :tangle R-intro/code/0403.R

(x <- 123 )
#+end_src

#+RESULTS:

* 3. 簡単な演算

  四則演算を含む様々な演算を行うことが可能です。

  #+begin_src R :tangle R-intro/code/0403.R

1+2 ## 入力すれば、

  #+end_src

  #+RESULTS:
  : [1] 3

  ベクトルの演算も可能で

  #+begin_src R :tangle R-intro/code/0403.R

c(1, 2, 3) + c(4, 5, 6) # ベクトル+ベクトル
c(1, 2, 3) * 2          # 全要素に2をかける

(x <- c(1, 2, 3))       # 変数へのベクトル値の代入
(x <- x * 2)            # x の保持するベクトル全要素に2をかける

  #+end_src

  #+RESULTS:
  : [1] 5 7 9
  : [1] 2 4 6
  : [1] 1 2 3
  : [1] 2 4 6

** 課題 3-1:
   変数 x にベクトル(1, 2, 3)、変数 y に 2 を代入し、x * y を計算して
   みましょう。 どんな答えが返ってきますか?

   #+begin_src R :tangle R-intro/code/0403.R



   #+end_src

    
** 課題 3-2: 
   変数 x にベクトル(1, 2, 3)を代入し、さらにそれを 3 倍にした結果を
   x に格納しましょう。

   #+begin_src R :tangle R-intro/code/0403.R


   #+end_src


